АлогистикТест2/src/Documents/алк_ВременныеТаможенныеДекларации/алк_ВременныеТаможенныеДекларации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ВременныеТаможенныеДекларации</name>
  <registerRecords>AccumulationRegister.алк_УчетВременныхДеклараций</registerRecords>
  <attributes>
    <name>НомерДекларации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемТаможня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНетто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБрутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_ВременныеТаможенныеДекларации/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументВТД, СтруктураДополнительныеСвойства) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ВременныеТаможенныеДекларацииЗапасы.Номенклатура,
		|	алк_ВременныеТаможенныеДекларацииЗапасы.Характеристика,
		|	алк_ВременныеТаможенныеДекларацииЗапасы.ОбъемТаможня,
		|	алк_ВременныеТаможенныеДекларацииЗапасы.ВесНетто,
		|	&Период,
		|	&ВидДвиженияПриход,
		|	алк_ВременныеТаможенныеДекларацииЗапасы.Ссылка КАК ВТД
		|ИЗ
		|	Документ.алк_ВременныеТаможенныеДекларации.Запасы КАК алк_ВременныеТаможенныеДекларацииЗапасы
		|ГДЕ
		|	алк_ВременныеТаможенныеДекларацииЗапасы.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДокументВТД);
		Запрос.УстановитьПараметр("Период", ДокументВТД.Дата);

		Запрос.УстановитьПараметр("ВидДвиженияПриход", ВидДвиженияНакопления.Приход);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУчетВременныхДеклараций", МассивРезультатов[0].Выгрузить());
			
	КонецПроцедуры

	Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
		
		Поля.Добавить("НомерДекларации");
		Поля.Добавить("Дата");
		
		СтандартнаяОбработка = Ложь;
		
	КонецПроцедуры

	Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
		
		СтандартнаяОбработка = Ложь;
		Представление = "ВТД: " + Данные.НомерДекларации + " от " + Формат(Данные.Дата, "ДЛФ=D");
		
	КонецПроцедуры
	
	#КонецОбласти
	

	
	#КонецЕсли
